#+TITLE: Dive!

** Ruby
#+begin_src ruby
  position = [0,0]
  File.readlines('input').each do |line|
    direction, amount = line.split
    amount = amount.to_i
    case direction
    when 'forward'
      position[0] += amount
    when 'down'
      position[1] += amount
    when 'up'
      position[1] -= amount
    end
  end

  position[0] * position[1]
#+end_src

#+RESULTS:
: 1727835

** Rust

#+begin_src rust
  use std::fs::File;
  use std::io::{BufRead, BufReader};

  fn main() {
      let f = File::open("input").expect("Unable to open file");
      let buf = BufReader::new(f);

      let mut position: [i32; 2] = [0, 0];
      for line in buf.lines() {
          let line = line.expect("Unable to read line");
          let command: Vec<&str> = line.split(' ').collect();
          let amount = command[1].parse::<i32>().unwrap();
          match command[0] {
              "forward" => position[0] += amount,
              "down" => position[1] += amount,
              "up" => position[1] -= amount,
              _ => panic!("unrecognized command '{}'", command[0])
          }
      }

      println!("{}", position[0] * position[1]);
  }
#+end_src

#+RESULTS:
: 1727835

** Ruby

#+begin_src ruby
  aim = 0
  position = [0, 0]
  File.readlines('input').each do |line|
    direction, amount = line.split
    amount = amount.to_i
    case direction
    when 'forward'
      position[0] += amount
      position[1] += amount * aim
    when 'down'
      aim += amount
    when 'up'
      aim -= amount
    end
  end

  position[0] * position[1]
#+end_src

#+RESULTS:
: 1544000595

** Rust

#+begin_src rust
  use std::fs::File;
  use std::io::{BufRead, BufReader};

  fn main() {
      let f = File::open("input").expect("Unable to open file");
      let buf = BufReader::new(f);

      let mut aim = 0;
      let mut position: [i32; 2] = [0, 0];
      for line in buf.lines() {
          let line = line.expect("Unable to read line");
          let command: Vec<&str> = line.split(' ').collect();
          let amount = command[1].parse::<i32>().unwrap();
          match command[0] {
              "forward" => {
                  position[0] += amount;
                  position[1] += amount * aim;
              },
              "down" => aim += amount,
              "up" => aim -= amount,
              _ => panic!("unrecognized command '{}'", command[0])
          }
      }

      println!("{}", position[0] * position[1]);
  }
#+end_src

#+RESULTS:
: 1544000595

